Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_3.tmx
Source language: de
Languages: en

source: Fassadenelemente für Bauten, nicht aus Metall
en: Non-metallic building facade elements

source: Abzweigrohre, nicht aus Metall
en: Branching pipes, not of metal

source: Dekorative Steine für Aquarien
en: Decorative aquarium stones

source: Pergolen, nicht aus Metall
en: Pergolas (Non-metallic -)

source: Bilderleisten [nicht aus Metall]
en: Picture rails (Non-metallic -)

source: Sicherheitsbarrieren [nicht aus Metall, ortsfeste Bauwerke]
en: Hazard warning barriers [non-metallic, fixed structures]

source: Hitzeschutzglas für Bauzwecke
en: Heat protective glass for building

source: Insektenschutzgitter, nicht aus Metall
en: Insect screens (Non-metallic -) for doors

source: Rundbögen [nicht aus Metall] zur Verwendung beim Bau
en: Arch frames (Non-metallic -) for use in construction

source: Vliesstoffe für die Bodenstabilisierung
en: Non-woven fabrics for soil stabilisation

source: Nicht gewebte Fasern zum Dachdecken
en: Non-woven fibres for use in roofing

source: Ziergegenstände für Aquarien aus Stein
en: Ornaments made of stone for aquaria

source: Einzäunungsmaterialien, nicht aus Metall
en: Fencing materials (Non-metallic -)

source: Zaunpaneelen, nicht aus Metall
en: Fencing panels (Non-metallic -)

source: Dachfensterrahmen [nicht aus Metall] für Gebäude
en: Skylight frames (Non-metallic -) for use in buildings

source: Bituminenhaltige Trägerbahnen
en: Bituminous sheet materials

source: Lüftungsleitungen, nicht aus Metall
en: Venting ducts (Non-metallic -)

source: Feuerfeste Keramikwerkstücke
en: Ceramic refractory workpieces

source: Wintergärten aus Holz
en: Conservatories made of wood

source: Schallschutzhauben [Bauten], nicht aus Metall
en: Soundproof hoods [structures], not of metal

source: Abstandshalter als Bauelemente aus faserverstärktem Zement
en: Spacers being building elements made of fibre reinforced cement

source: Feuerhemmendes Glas zur Verwendung im Bauwesen
en: Fire retarding glass for use in construction

source: Platten, nicht aus Metall, für Bauzwecke
en: Slabs, not of metal, for building

source: Holzbretter für Bauzwecke
en: Planks of wood for building

source: Unterstände [Bauten, nicht aus Metall]
en: Sheds (Non-metallic buildings -)

source: Fliesen aus Marmor
en: Tiles of marble

source: Kipptüren für Gebäude, nicht aus Metall
en: Tiltable doors (Non-metallic -) for buildings

source: Marmor
en: Marble

source: Kehlen, nicht aus Metall, für Bauzwecke
en: Flashing, not of metal, for building

source: Leitungen für Lüftungs- und Klimaanlagen, nicht aus Metall
en: Ducts, not of metal, for ventilating and air-conditioning installations

source: Gips zum Reparieren von Rissen im Putz
en: Plaster for repairing cracks in plaster

source: Kammern [Bauten, nicht aus Metall]
en: Chambers [non-metallic structures]

source: Fahrradunterstände [Bauwerke], nicht aus Metall
en: Bicycle sheds [structures] of non-metallic materials

source: Lüftungslamellen [nicht aus Metall] für Gebäude
en: Louvre vents (Non-metallic -) for buildings

source: Holz für Bauzwecke
en: Wood for building

source: Sicherheitsglas für Bauzwecke
en: Security glass for use in building

source: Sicherheitsgitter [nicht aus Metall] für den Außenbereich von Gebäuden
en: Security gratings (Non-metallic -) for the outside of buildings

source: Telegrafenmasten, nicht aus Metall
en: Telegraph posts, not of metal

source: Drainageschichten [nicht aus Metall]
en: Drainage courses (Non-metallic -)

source: Verstärkungsgewebe, nicht aus Metall, für Bauzwecke
en: Reinforcing fabrics (Non-metallic -) for building

source: Dächer, nicht aus Metall, mit integrierten Solarzellen
en: Roofing, not of metal, incorporating solar cells

source: Handläufe, nicht aus Metall, für Treppen
en: Handrails of non-metallic materials for stairs

source: Transportable Räume, nicht aus Metall, mit Duschen
en: Transportable rooms (Non-metallic -) incorporating showers

source: Baumschutzgitter, nicht aus Metall
en: Tree guards (non-metallic -) [structures]

source: Gedenksteine aus Marmor
en: Memorials of marble

source: Pressbares Holz
en: Mouldable wood

source: Gewebte Geotextilien für den Sicherung von Ufern gegen Erosion
en: Woven geotextile materials (Non-metallic -) for protecting banks against erosion

source: Gewebte Geotextilien für die Sicherung von Deichen gegen Erosion
en: Woven geotextile materials (Non-metallic -) for protecting dikes against erosion

source: Gewebe [nicht aus Metall] zur Verwendung im Bauwesen
en: Woven materials (Non-metallic -) for use in buildings

source: Teiche [Bauten, nicht aus Metall]
en: Ponds [non-metallic structures]

source: Transportable Kabinen, nicht aus Metall
en: Portable cabins (Non-metallic -)

source: Transportable Sicherheitskabinen [nicht aus Metall] für den Außenbereich
en: Portable outdoor security cabins made of non-metallic materials

source: Schachtdeckel, nicht aus Metall
en: Manhole covers, not of metal

source: Eingleisige Schienen [nicht aus Metall]
en: Monorail tracks (Non-metallic -)

source: Mineralgranulat für den Einsatz im Bauwesen
en: Mineral pellets for use in the building industry

source: Bitumenpappen für Bauzwecke
en: Asphalt felt [for building purposes]

source: Schachtmauerwerk [nicht aus Metall]
en: Stack linings (Non-metallic -)

source: Ställe [Bauten], nicht aus Metall, für Pferde
en: Stalls [structures], not of metal for horses

source: Rollläden [nicht aus Metall] für Fenster
en: Shutters (Non-metallic -) for windows

source: Lüftungskanäle, nicht aus Metall, für Gebäude
en: Air ducts of non-metallic materials for buildings

source: Grabsteine aus Stein, Beton oder Marmor
en: Tombstones of stone, concrete or marble

source: Thermojalousien, nicht aus Metall [Lamellen, außen]
en: Thermal blinds (non-metallic -) [slatted outdoor]

source: Nicht metallische Balken für Mauerwerke
en: Ties (Non-metallic -) for use in brickwork

source: Gummibröselbeläge für Sicherheitsspielflächen
en: Rubber crumb surfacing for use in safety play areas

source: Vorgeformte Gebäudeteile [nicht aus Metall]
en: Preformed building sections (Non-metallic -)

source: Heizkörpereinfassungen, nicht aus Metall
en: Radiator surrounds of non-metallic materials

source: Signaltafeln, nicht leuchtend, nicht mechanisch und nicht aus Metall
en: Signalling panels, non-luminous and non-mechanical, not of metal

source: Gewobene Textilien zur Stabilisierung von Erdhängen
en: Woven textiles (Non-metallic -) for stabilising earth slopes

source: Bituminierte Bedachungsmaterialien
en: Bitumenized roofing materials

source: Plakatsäulen, nicht aus Metall
en: Advertisement columns, not of metal

source: Nicht metallische Mineralien für Bau- oder Konstruktionszwecke
en: Non-metallic minerals for building or construction

source: Ankleideräume aus nicht metallischen Materialien [Bauten]
en: Changing rooms [structures] of non-metallic materials

source: Bauschreinerprodukte aus Holz für Bauzwecke
en: Joinery products of timber for use in buildings

source: Schichtstoffplatten [nicht aus Metall] für Bauzwecke
en: Laminated boards (Non-metallic -) for building use

source: Laminiertes Bauglas mit einem Flüssigkristallfilm
en: Laminated building glass incorporating a liquid crystal film

source: Laminate, nicht aus Metall
en: Laminates (Non-metallic -)

source: Formlinge aus Zuckerrohrbagasse [Baumaterial]
en: Agglomerated bagasses of cane [building material]

source: Niedrige Tunnelbögen [nicht aus Metall oder nicht metallischer Rahmen] für den Pflanzenschutz
en: Low tunnels [non-metallic or non-metallic frame] for the protection of plants

source: Straßenbelagplatten aus Beton
en: Concrete road pavement boards

source: Rahmen [nicht aus Metall] für Ladenfronten
en: Frames (Non-metallic -) for shop fronts

source: Garagentore, nicht aus Metall, für häusliche Zwecke
en: Garage doors (Non-metallic -) for domestic use

source: Rahmenkonstruktionen, nicht aus Metall, für Gebäude
en: Structural frameworks (Non-metallic -) for buildings

source: Rohre, nicht aus Metall, für Dachrinnenanlagen
en: Non-metallic pipes for roof drainage installations

source: Bretter
en: Planks

source: Soffitte [nicht aus Metall]
en: Soffits (Non-metallic -)

source: Baumaterialien aus Beton verstärkt mit Kunststoff- und Glasfasern
en: Building materials of concrete reinforced with plastics and glass fibres

source: Feuerfeste Manschetten [nicht aus Metall] für Rohre
en: Fire resistant collars (Non-metallic -) for pipes

source: Überdachte Laufwege aus Glas mit einem nicht metallischen Rahmen
en: Covered walkways of glass and having a non-metallic frame

source: Bordsteine
en: Curb stones

source: Außenrollläden aus Kunststoff
en: Roller shades [outdoor] of plastic

source: Pflastersteine, nicht aus Metall
en: Paving blocks, not of metal

source: Feuerfeste Mörtel, nicht aus Metall
en: Refractory mortars [non-metallic]

source: Begrenzungspfosten, nicht aus Metall
en: Boundary posts of non-metallic materials

source: Begrenzungsschienen, nicht aus Metall
en: Boundary rails of non-metallic materials

source: Ziegelsteine als feuerfeste Artikel
en: Bricks being refractory articles

source: Straßenverkehrsrichtungsanzeigen [nicht aus Metall, nicht mechanisch, nicht leuchtend]
en: Road traffic direction devices [non-metallic, non-mechanical, non-luminous]

source: Nicht metallisches Baumaterial für Bedachungen
en: Roof construction materials (Non-metallic -)

source: Rohre aus Zement
en: Pipes made of cement

source: Gitterroste, nicht aus Metall
en: Gratings (Non-metallic -)

source: Infrarotreflektierendes Glas zur Verwendung im Bauwesen
en: Infrared reflective glass for use in building

source: Glaselemente für Fenster
en: Glass elements for windows

source: Ziergegenstände für Teiche aus Stein
en: Ornaments made of stone for ponds

source: Zaunpfähle, nicht aus Metall
en: Fence posts of non-metallic materials

source: Zaunpfähle aus Kunststoffen
en: Fencing posts made of plastics

source: Schiefer für Dachverkleidungen
en: Slates for roof cladding

source: Wintergärten, nicht aus Metall
en: Conservatories, not of metal

source: Dehnbare Wabenelemente [nicht aus Metall]
en: Expanded honeycombs (Non-metallic -)

source: Baumaterialien [nicht aus Metall] zur feuerfesten Abdichtung
en: Fireproof seals in the nature of building materials

source: Spanplatten mit Holzlaminierung
en: Timber laminated particle boards

source: Keramikziegel zur Verwendung in feuerfesten Öfen
en: Ceramic bricks for use in refractory furnaces

source: Gedenktafeln aus Beton
en: Plaques made of concrete

source: Gips für Gussstücke [nicht medizinische]
en: Plaster for casting [not medical]

source: Rutschen [nicht aus Metall] für Bauzwecke
en: Chutes (Non-metallic -) for building purposes

source: Simse [nicht aus Metall]
en: Cills of non-metallic materials

source: Auskleidungsplatten [nicht aus Metall]
en: Cladding board (Non-metallic -)

source: Nicht metallische Verkleidungsplatten für Dächer
en: Cladding panels (Non-metallic -) for roofs

source: Verkleidungstafeln aus Holz
en: Cladding sheets of wood

source: Verbundglas
en: Layered glass

source: Briefkastenklappen aus Mauerwerk
en: Letter-box flaps of masonry

source: Sicherheitstürrahmen [nicht aus Metall] für Gebäude
en: Security door frames (Non-metallic -) for buildings

source: Türfüllungen, nicht aus Metall
en: Door panels, not of metal

source: Drainageinstallationen, nicht aus Metall
en: Drainage installations (Non-metallic -)

source: Feuerfeste Keramikmassen
en: Refractory ceramic masses

source: Bewehrungsstäbe, nicht aus Metall
en: Reinforcement rods, not of metal

source: Bituminöse Überzugsmassen für Dächer
en: Bituminous coatings for roofing

source: Durchscheinende Fliesen [nicht aus Metall]
en: Translucent tiles (Non-metallic -)

source: Glasgranulat für die Straßenmarkierung
en: Glass granules for road marking

source: Statuen aus Beton
en: Statues of concrete

source: Polystyren-Platten für Bauzwecke
en: Polystyrene panels for use in building

source: Veranden, nicht aus Metall
en: Porticos (Non-metallic -)

source: Vorgefertigte Bauelemente [nicht aus Metall] für die Vor-Ort-Montage
en: Prefabricated building elements (Non-metallic -) for on site assembly

source: Volieren [Bauten], nicht aus Metall
en: Aviaries [structures], not of metal

source: Pech
en: Pitch

source: Wartehäuschen [Bauten] aus nicht metallischen Materialien
en: Bus shelters [structures] made of non-metallic materials

source: Flüssigkeitsspeichertanks aus Mauerwerk für industrielle Zwecke
en: Liquid storage tanks of masonry [for industrial purposes]

source: Zuschlagstoffe für die Betonherstellung
en: Aggregates for use in the preparation of concrete

source: Zierputz zu Dekorationszwecken
en: Decorative ornamental plasterwork

source: Kork [komprimiert]
en: Cork [compressed]

source: Nicht metallische Balken für Bauzwecke
en: Ties (Non-metallic -) for use in building

source: Auslaufschächte, nicht aus Metall
en: Run-off channels, not of metal

source: Vorgefertigte Bauten, nicht aus Metall
en: Prefabricated non-metal buildings

source: Gewobene Textilien zum Schutz der Ufer von Wasserläufen
en: Woven textiles (Non-metallic -) for protecting the banks of watercourses

source: Gewobene Textilien zum Schutz der Böden von Wasserläufen
en: Woven textiles (Non-metallic -) for protecting the bottoms of watercourses

source: Gewobene Textilien zur Stabilisierung von weichen Unterböden
en: Woven textiles (Non-metallic -) for stabilising soft subsoils

source: Gewobene Textilien zur Stabilisierung der Böden von Wasserläufen
en: Woven textiles (Non-metallic -) for stabilising the bottoms of watercourses

source: Dachfenster aus Kunststoffen
en: Roof windows made of plastics

source: Plattformen, nicht aus Metall
en: Platforms of non-metallic materials

source: Polymer-Bitumenemulsionen für Straßenbeläge
en: Polymeric bitumen emulsions for road surfaces

source: Zementhaltige Restaurationsbeschichtungen
en: Cementitious restorative coatings

source: Laminierte Faserplatten
en: Laminated fibreboard

source: Wachspapier für Bauzwecke
en: Waxed paper for use in building

source: Rahmen, nicht aus Metall, für Veranden
en: Frames (Non-metallic -) for verandas

source: Friese [Bauelemente, nicht aus Metall]
en: Friezes [non-metallic building elements]

source: Porphyr [Stein]
en: Porphyry [stone]

source: Absperrpfosten, nicht aus Metall
en: Barrier poles [non of metal]

source: Bitumenhaltige Abdeckungen für Bauzwecke
en: Bituminous coverings for use in building construction

source: Farbspritzkabinen, nicht aus Metall
en: Paint spraying booths, not of metal

source: Schleusentore [nicht aus Metall] zur Regelung des Durchflusses von Schlamm
en: Sluice gates of non-metallic materials for controlling the flow of sludges

source: Faserplatten für Bauzwecke
en: Fibreboard for building

source: Behälter aus Beton
en: Containers of concrete

source: Glasplatten für Türen
en: Glass panels for doors

source: Transportable Straßensignaltafeln, nicht leuchtend, nicht mechanisch, nicht aus Metall
en: Portable signs [non-luminous, non-mechanical, non-metallic] for roads

source: Deckenplatten, nicht aus Metall
en: Ceiling coffers of non-metallic materials

source: Deckenfliesen, nicht aus Metall
en: Ceiling tiles (Non-metallic -)

source: Fassadenelemente, nicht aus Metall
en: Facade elements of non-metallic materials

source: Zwischenwände als Baumaterialien [nicht aus Metall]
en: Partitions being non-metallic building materials

source: Wegeinfassungen, nicht aus Metall
en: Path edgings made of non-metallic materials

source: Stützmauern aus Beton
en: Concrete retaining walls

source: Erosionsschutzgewebe [Bauwesen]
en: Erosion control fabric [construction]

source: Einkaufswagenhäuschen, nicht aus Metall [Bauten]
en: Trolley shelters (non-metallic -) [structures]

source: Gedenksteine aus Granit
en: Memorials of granite

source: Modulare Gebäudeelemente [nicht aus Metall]
en: Modular building units (Non-metallic -)

source: Nischen, nicht aus Metall
en: Niches (Non-metallic -)

source: Deckenplatten aus Holz
en: Ceiling boards of wood

source: Akustikbauplatten aus Holz für Decken
en: Acoustic panels of wood for ceilings

source: Hitzeabweisendes Glas für Bauzwecke
en: Heat reflecting glass for building

source: Gartenpfähle, nicht aus Metall
en: Garden stakes of non-metallic materials

source: Torbögen aus nicht metallischen Materialien
en: Archways made from non-metallic materials

source: Nicht metallisches Fundamentmaterial für Bauzwecke
en: Foundation material (Non-metallic -) for use in construction

source: Dachziegel aus Zementmörtel
en: Cement mortar roofing tiles

source: Keramikfliesen für Innenfußböden
en: Ceramic tiles for internal floors

source: Pflasterelemente aus Beton
en: Concrete paving elements

source: Ausstellungsstände [Bauten, nicht aus Metall]
en: Exhibition stands [non-metallic structures]

source: Dehnungsfugen aus nicht metallischen Materialien für Bauzwecke
en: Expansion joints of non-metallic materials for use in construction

source: Raumabtrennungen [Bauten], nicht aus Metall
en: Space dividers [structures], not of metal

source: Nicht metallische Spandrillen
en: Spandrel panels (Non-metallic -)

source: Sandstein für Bauzwecke
en: Sandstone for building

source: Schlacke [Baumaterial]
en: Slag [building material]

source: Feuerfeste Platten [nicht aus Metall] für Bauzwecke
en: Fireproof panels for use in building (Non-metallic -)

source: Sicherheitsrollläden, nicht aus Metall
en: Security shutters of non-metallic materials

source: Ladengitter, nicht aus Metall
en: Servery grilles, not of metal

source: Schutzdächer, nicht aus Metall
en: Shelters (Non-metallic -)

source: Bauplatten aus Holz
en: Timber building boards

source: Olivin für Bauzwecke
en: Olivine for building

source: Baumaterialien aus Beton
en: Concrete building materials

source: Verkleidungsmaterialien, nicht aus Metall
en: Cladding materials (Non-metallic -)

source: Verkleidungstafeln [nicht aus Metall]
en: Cladding sheets (Non-metallic -)

source: PVC-Membran für Dächer
en: PVC roofing membrane

source: Vorgefertigte Bauelemente [nicht aus Metall]
en: Manufactured building elements (Non-metallic -)

source: Hühnerställe, nicht aus Metall
en: Chicken-houses, not of metal

source: Kanalinstallationen, nicht elektrisch und nicht aus Metall
en: Ducts (installations of -) [non-metallic, non-electric]

source: Verstärktes Geflecht aus Textilfasern für Bauzwecke
en: Reinforcing mesh made of textile fibres for construction purposes

source: Feuerfeste Baumaterialien, nicht aus Metall
en: Refractory construction materials, not of metal

source: Gehärtetes Glas für Bauzwecke
en: Toughened glass for building

source: Lichtdurchlässige Bauplatten aus Kunststoff
en: Translucent building panels made from plastics materials

source: Falltüren, nicht aus Metall
en: Trap doors (Non-metallic -)

source: Baumgitter, nicht aus Metall
en: Tree grilles (Non-metallic -)

source: Hydraulischer Zement
en: Hydraulic cement

source: Arbeitsbühnen [Gerüste], nicht aus Metall
en: Working platforms [scaffolding], not of metal

source: Gewebe [nicht aus Metall] für die Sicherung von Ufern gegen Erosion
en: Woven fabrics (Non-metallic -) for the protection of banks against erosion

source: Vorisolierte Verbundrohre [nicht aus Metall] für Bauzwecke
en: Pre-insulated bonded pipes (Non-metallic -) for building

source: Falttüren, nicht aus Metall
en: Folding doors, not of metal

source: Rohre für Bauzwecke, nicht aus Metall
en: Rigid pipes, not of metal, for building

source: Isolierglas für Bauzwecke
en: Insulating glass for building

source: Bewegliche Bühnenplattformen mit Rahmen, nicht aus Metall
en: Movable non-metallic framed stage platform units

source: Kalkstein
en: Limestone

source: Bühnenkonstruktionen, nicht aus Metall
en: Stage platform structures (Non-metallic -)

source: Treppenbauteile [nicht aus Metall]
en: Stair components (Non-metallic -)

source: Fußbodenbretter, nicht aus Metall
en: Floor boards (Non-metallic -)

source: Kunststofftüren für Gebäude
en: Doors made of plastic for buildings

source: Raketenabschussrampen, nicht aus Metall
en: Rocket launching platforms, not of metal

source: Strukturierte Betonoberflächen
en: Textured concrete finishes

source: Nicht metallische Balken für Höhlenwände
en: Ties (Non-metallic -) for cavity walls

source: Regenwassertrichter, nicht aus Metall
en: Rainwater hoppers of non-metallic materials

source: Pech, Teer, Bitumen und Asphalt
en: Pitch, tar, bitumen and asphalt

source: Gewebte Matten [nicht aus Metall] zur Sicherung von Deichen gegen Erosion
en: Woven mats (Non-metallic -) for the protection of dikes against erosion

source: Gewebte Matten [nicht aus Metall] zur Sicherung von Hängen gegen Erosion
en: Woven mats (Non-metallic -) for the protection of slopes against erosion

source: Plattformstufen, nicht aus Metall, zur Verwendung mit Gerüsten
en: Platform steps (Non-metallic -) for use with scaffolding

source: Randleisten, nicht aus Metall, für Gesimse
en: Mouldings, not of metal, for cornices

source: Kunstgegenstände aus Stein, Beton oder Marmor
en: Works of art of stone, concrete or marble

source: Vogelbäder [Bauten], nicht aus Metall
en: Bird baths [structures], not of metal

source: Modifiziertes Fensterglas für Bauzwecke
en: Modified sheet glass [for building]

source: Feuerfester Beton
en: Refractory concrete

source: Silikatzement [puzzolanischer Zement]
en: Silica cement [pozzolanic cement]

source: Laminiertes Bauglas mit eingebetteten, feinen elektrischen Leitungen
en: Laminated building glass incorporating fine electrical conductors

source: Straßen- und Bodenbeläge aus Sandstein
en: Stoneware paving blocks and surfacings

source: Fensterkästen aus Mauerstein
en: Window boxes made of masonry

source: Badezimmerfliesen, nicht aus Metall
en: Bathroom tiles (Non-metallic -)

source: Bituminöse Versiegelungsmassen für Zufahrten
en: Bitumen-based sealants for driveways

source: Außenlichtblenden, nicht aus Metall oder Textil
en: Sun screens [outdoor], not of metal or textile

source: Lagerschuppen, nicht aus Metall
en: Non-metallic storage shelters

source: Fliesen [nicht aus Metall] zur Deckenverkleidung
en: Non-metallic tiles for ceiling cladding

source: Wasserleitungen, nicht aus Metall [ausgenommen Teile von sanitären Anlagen]
en: Non-metallic water pipes [other than parts of sanitary installations]

source: Traufbretter [aus Kunststoff]
en: Soffit boards (Plastic -)

source: Brandschutzabschirmungen[nicht aus Metall] für Elektrokabel
en: Fire protection screenings (Non-metallic -) for electric cables

source: Baumaterialien aus Natursteinen
en: Construction materials of natural stone

source: Baustoffe aus angereichertem Zementmörtel
en: Constructional components of reinforced cement mortar

source: Kehlen, nicht aus Metall
en: Coving (Non-metallic -)

source: Fahrbahnprofile, nicht aus Metall
en: Deck profiles, not of metal

source: Dachfensterklappen aus nicht metallischen Materialien
en: Roof fanlights [windows] of non-metallic materials

source: Dachplatten [nicht aus Metall]
en: Roofing plate (Non-metallic -)

source: Bauplatten, nicht aus Metall
en: Building panels, not of metal

source: Nicht metallische Materialien zur Raumabtrennung
en: Partitioning materials (Non-metallic -)

source: Feuerfeste Formteile, nicht aus Metall
en: Refractory shapes [non-metallic]

source: Hartrohre, nicht aus Metall
en: Rigid pipes, not of metal

source: Gewölbe aus Beton
en: Concrete vaults

source: Fest montierte Fahrbahnschwellen, nicht aus Metall
en: Road humps (Non-metallic -) for slowing traffic

source: Straßenanzeigetafeln [nicht aus Metall, nicht mechanisch, nicht leuchtend]
en: Roadside display boards [non-metallic, non-mechanical, non-luminous]
